{
    "<PAD>": 0,
    "<UNK>": 1,
    "0": 2,
    "1": 3,
    "2": 4,
    "3": 5,
    "4": 6,
    "5": 7,
    "6": 8,
    "7": 9,
    "8": 10,
    "9": 11,
    "Are": 12,
    "Do": 13,
    "Does": 14,
    "How": 15,
    "Is": 16,
    "The": 17,
    "There": 18,
    "What": 19,
    "a": 20,
    "an": 21,
    "and": 22,
    "another": 23,
    "any": 24,
    "anything": 25,
    "are": 26,
    "as": 27,
    "ball": 28,
    "ball;": 29,
    "ball?": 30,
    "balls": 31,
    "balls?": 32,
    "behind": 33,
    "big": 34,
    "block": 35,
    "block;": 36,
    "block?": 37,
    "blocks": 38,
    "blocks?": 39,
    "blue": 40,
    "both": 41,
    "brown": 42,
    "color": 43,
    "color?": 44,
    "count": 45,
    "cube": 46,
    "cube;": 47,
    "cube?": 48,
    "cubes": 49,
    "cubes?": 50,
    "cyan": 51,
    "cylinder": 52,
    "cylinder;": 53,
    "cylinder?": 54,
    "cylinders": 55,
    "cylinders?": 56,
    "does": 57,
    "either": 58,
    "else": 59,
    "end": 60,
    "equal": 61,
    "equal_color": 62,
    "equal_integer": 63,
    "equal_material": 64,
    "equal_shape": 65,
    "equal_size": 66,
    "exist": 67,
    "fewer": 68,
    "filter_color[blue]": 69,
    "filter_color[brown]": 70,
    "filter_color[cyan]": 71,
    "filter_color[gray]": 72,
    "filter_color[green]": 73,
    "filter_color[purple]": 74,
    "filter_color[red]": 75,
    "filter_color[yellow]": 76,
    "filter_material[metal]": 77,
    "filter_material[rubber]": 78,
    "filter_shape[cube]": 79,
    "filter_shape[cylinder]": 80,
    "filter_shape[sphere]": 81,
    "filter_size[large]": 82,
    "filter_size[small]": 83,
    "front": 84,
    "gray": 85,
    "greater": 86,
    "greater_than": 87,
    "green": 88,
    "has": 89,
    "have": 90,
    "how": 91,
    "in": 92,
    "intersect": 93,
    "is": 94,
    "it": 95,
    "it?": 96,
    "its": 97,
    "large": 98,
    "left": 99,
    "less": 100,
    "less_than": 101,
    "made": 102,
    "many": 103,
    "material": 104,
    "material?": 105,
    "matte": 106,
    "metal": 107,
    "metallic": 108,
    "more": 109,
    "no": 110,
    "number": 111,
    "object": 112,
    "object;": 113,
    "object?": 114,
    "objects": 115,
    "objects?": 116,
    "of": 117,
    "of?": 118,
    "on": 119,
    "or": 120,
    "other": 121,
    "purple": 122,
    "query_color": 123,
    "query_material": 124,
    "query_shape": 125,
    "query_size": 126,
    "red": 127,
    "relate[behind]": 128,
    "relate[front]": 129,
    "relate[left]": 130,
    "relate[right]": 131,
    "right": 132,
    "rubber": 133,
    "same": 134,
    "same_color": 135,
    "same_material": 136,
    "same_shape": 137,
    "same_size": 138,
    "scene": 139,
    "shape": 140,
    "shape?": 141,
    "shiny": 142,
    "side": 143,
    "size": 144,
    "size?": 145,
    "small": 146,
    "sphere": 147,
    "sphere;": 148,
    "sphere?": 149,
    "spheres": 150,
    "spheres?": 151,
    "than": 152,
    "that": 153,
    "the": 154,
    "there": 155,
    "there?": 156,
    "thing": 157,
    "thing;": 158,
    "thing?": 159,
    "things": 160,
    "things?": 161,
    "tiny": 162,
    "to": 163,
    "union": 164,
    "unique": 165,
    "visible?": 166,
    "what": 167,
    "yellow": 168,
    "yes": 169
}